In [1]:
import pandas as pd
import numpy as np

In [2]:
data=np.random.randn(4,3)

In [3]:
data

array([[-0.47033628, -0.03164524, -0.9713465 ],
       [ 0.14727039,  0.05355047, -1.17937777],
       [-0.37353126,  1.22429933,  0.36813966],
       [ 0.28930876, -0.61019162,  0.00866593]])

In [4]:
dataFrame=pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0 -0.470336 -0.031645 -0.971347
1  0.147270  0.053550 -1.179378
2 -0.373531  1.224299  0.368140
3  0.289309 -0.610192  0.008666

In [6]:
dataFrame[0]

0   -0.470336
1    0.147270
2   -0.373531
3    0.289309
Name: 0, dtype: float64

In [7]:
yeniDataFrame=pd.DataFrame(data,index=["a","b","c","d"],columns=["maas","yas","saat"])

In [8]:
yeniDataFrame

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [9]:
yeniDataFrame["yas"]

a   -0.031645
b    0.053550
c    1.224299
d   -0.610192
Name: yas, dtype: float64

In [10]:
yeniDataFrame[["yas","maas"]]

        yas      maas
a -0.031645 -0.470336
b  0.053550  0.147270
c  1.224299 -0.373531
d -0.610192  0.289309

In [11]:
yeniDataFrame.loc["a"]

maas   -0.470336
yas    -0.031645
saat   -0.971347
Name: a, dtype: float64

In [12]:
yeniDataFrame.iloc[3]

maas    0.289309
yas    -0.610192
saat    0.008666
Name: d, dtype: float64

In [13]:
yeniDataFrame["maas"]

a   -0.470336
b    0.147270
c   -0.373531
d    0.289309
Name: maas, dtype: float64

In [14]:
yeniDataFrame["emeklilik"]=yeniDataFrame["yas"]*2

In [15]:
yeniDataFrame

       maas       yas      saat  emeklilik
a -0.470336 -0.031645 -0.971347  -0.063290
b  0.147270  0.053550 -1.179378   0.107101
c -0.373531  1.224299  0.368140   2.448599
d  0.289309 -0.610192  0.008666  -1.220383

In [16]:
yeniDataFrame.drop("emeklilik",axis=1)

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [17]:
yeniDataFrame.drop("d",axis=0)

       maas       yas      saat  emeklilik
a -0.470336 -0.031645 -0.971347  -0.063290
b  0.147270  0.053550 -1.179378   0.107101
c -0.373531  1.224299  0.368140   2.448599

In [18]:
yeniDataFrame

       maas       yas      saat  emeklilik
a -0.470336 -0.031645 -0.971347  -0.063290
b  0.147270  0.053550 -1.179378   0.107101
c -0.373531  1.224299  0.368140   2.448599
d  0.289309 -0.610192  0.008666  -1.220383

In [19]:
## degişiklikler framede kaydedilsin istenniyorsa inplace=True
yeniDataFrame.drop("emeklilik",axis=1,inplace=True)

In [20]:
yeniDataFrame

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [21]:
yeniDataFrame.loc["a"]["yas"]

-0.031645237749344725

In [22]:
yeniDataFrame.loc["a","maas"]

-0.4703362800484287

In [23]:
yeniDataFrame

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [24]:
yeniBoolFrame=yeniDataFrame<0

In [25]:
yeniDataFrame[yeniBoolFrame]

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b       NaN       NaN -1.179378
c -0.373531       NaN       NaN
d       NaN -0.610192       NaN

In [26]:
yeniDataFrame[yeniDataFrame>0]

       maas       yas      saat
a       NaN       NaN       NaN
b  0.147270  0.053550       NaN
c       NaN  1.224299  0.368140
d  0.289309       NaN  0.008666

In [27]:
##calisma saati 0 dan kücük olan elemanları direkt elimine ediyor
yeniDataFrame[yeniDataFrame["saat"]>0]

       maas       yas      saat
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [28]:
yeniDataFrame

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [29]:
yeniDataFrame.reset_index()

  index      maas       yas      saat
0     a -0.470336 -0.031645 -0.971347
1     b  0.147270  0.053550 -1.179378
2     c -0.373531  1.224299  0.368140
3     d  0.289309 -0.610192  0.008666

In [30]:
yeniDataFrame

       maas       yas      saat
a -0.470336 -0.031645 -0.971347
b  0.147270  0.053550 -1.179378
c -0.373531  1.224299  0.368140
d  0.289309 -0.610192  0.008666

In [31]:
yenindex=["f","g","h","j"]

In [32]:
yeniDataFrame["yeni index"]=yenindex

In [33]:
yeniDataFrame

       maas       yas      saat yeni index
a -0.470336 -0.031645 -0.971347          f
b  0.147270  0.053550 -1.179378          g
c -0.373531  1.224299  0.368140          h
d  0.289309 -0.610192  0.008666          j

In [34]:
yeniDataFrame.set_index("yeni index",inplace=True)

In [35]:
yeniDataFrame

                maas       yas      saat
yeni index
f          -0.470336 -0.031645 -0.971347
g           0.147270  0.053550 -1.179378
h          -0.373531  1.224299  0.368140
j           0.289309 -0.610192  0.008666

In [36]:
yeniDataFrame.loc["h"]

maas   -0.373531
yas     1.224299
saat    0.368140
Name: h, dtype: float64

In [37]:
## multi index

In [38]:
ilkindeksler=["simpson","simpson","simpson","south park","south park","south park",]

In [39]:
icindeksler=["homer","bart","marge","cartman","kenny","kyle"]

In [40]:
birlesmisindeks=list(zip(ilkindeksler,icindeksler))

In [41]:
birlesmisindeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kenny'),
 ('south park', 'kyle')]

In [42]:
birlesmisindeks=pd.MultiIndex.from_tuples(birlesmisindeks)

In [43]:
birlesmisindeks

MultiIndex([(   'simpson',   'homer'),
            (   'simpson',    'bart'),
            (   'simpson',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kenny'),
            ('south park',    'kyle')],
           )

In [44]:
benimCizgiFilm=[[40,"a"],[140,"b"],[420,"c"],[440,"u"],[540,"y"],[64,"f"]]

In [45]:
cizgiFilmNumpy=np.array(benimCizgiFilm)

In [46]:
cizgiDataFrame=pd.DataFrame(cizgiFilmNumpy,index=birlesmisindeks,columns=["yas","meslek"])

In [47]:
cizgiDataFrame

                    yas meslek
simpson    homer     40      a
           bart     140      b
           marge    420      c
south park cartman  440      u
           kenny    540      y
           kyle      64      f

In [48]:
cizgiDataFrame.loc["simpson"]

       yas meslek
homer   40      a
bart   140      b
marge  420      c

In [49]:
cizgiDataFrame["yas"]

simpson     homer       40
            bart       140
            marge      420
south park  cartman    440
            kenny      540
            kyle        64
Name: yas, dtype: object

In [50]:
cizgiDataFrame.loc["simpson"].loc["bart"]

yas       140
meslek      b
Name: bart, dtype: object

In [51]:
cizgiDataFrame.index.names=["film","isim"]

In [52]:
cizgiDataFrame

                    yas meslek
film       isim
simpson    homer     40      a
           bart     140      b
           marge    420      c
south park cartman  440      u
           kenny    540      y
           kyle      64      f

In [53]:
##pandas operasyonlar
##eksik veriler

In [54]:
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,49]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [55]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     49

In [56]:
havaDurumuDataFrame.dropna(axis=0)
## havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [57]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     49

In [58]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     49

In [59]:
sozlukVerisi1={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,49],"antalya":[64,np.nan,np.nan]}
havaDurumuDataFrame1=pd.DataFrame(sozlukVerisi1)

In [60]:
havaDurumuDataFrame1

   Istanbul  Ankara  Izmir  antalya
0      30.0    20.0     40     64.0
1      29.0     NaN     39      NaN
2       NaN    25.0     49      NaN

In [61]:
havaDurumuDataFrame1.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     49

In [62]:
havaDurumuDataFrame1.fillna(20)

   Istanbul  Ankara  Izmir  antalya
0      30.0    20.0     40     64.0
1      29.0    20.0     39     20.0
2      20.0    25.0     49     20.0

## groupby

In [63]:
sirketSozlugu={"departman":["yazılım","yazılım","finans","finans","pazarlama","pazarlama"],
            "calisan ismi" : ["ahmet","ali","mehmet","asli","ayse","alina"],"maas":[100,200,300,400,500,600]}

In [64]:
sirketDataFrame=pd.DataFrame(sirketSozlugu)

In [65]:
sirketDataFrame

   departman calisan ismi  maas
0    yazılım        ahmet   100
1    yazılım          ali   200
2     finans       mehmet   300
3     finans         asli   400
4  pazarlama         ayse   500
5  pazarlama        alina   600

In [66]:
grupObjesi=sirketDataFrame.groupby("departman")

In [67]:
grupObjesi.count()

           calisan ismi  maas
departman
finans                2     2
pazarlama             2     2
yazılım               2     2

In [68]:
grupObjesi.mean()

C:\Users\İbrahim ATAŞ\AppData\Local\Temp\ipykernel_12468\104408460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean()

            maas
departman
finans     350.0
pazarlama  550.0
yazılım    150.0

In [69]:
grupObjesi.min()

          calisan ismi  maas
departman
finans            asli   300
pazarlama        alina   500
yazılım          ahmet   100

In [70]:
grupObjesi.max()

          calisan ismi  maas
departman
finans          mehmet   400
pazarlama         ayse   600
yazılım            ali   200

In [71]:
grupObjesi.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
finans      2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
pazarlama   2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

In [72]:
############## concatenation #####################

In [73]:
sozluk1={"isim":["a","b","c","d"],"spor":["koşu","yüzme","koşu","basket"],"kalori":
        [100,200,300,400]}
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [74]:
dataFrame1

  isim    spor  kalori
0    a    koşu     100
1    b   yüzme     200
2    c    koşu     300
3    d  basket     400

In [75]:
sozluk2={"isim":["e","f","g","h"],"spor":["koşu","yüzme","koşu","basket"],"kalori":
        [600,700,800,900]}
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [76]:
dataFrame2

  isim    spor  kalori
4    e    koşu     600
5    f   yüzme     700
6    g    koşu     800
7    h  basket     900

In [77]:
sozluk3={"isim":["j","k","l","p"],"spor":["koşu","yüzme","koşu","basket"],"kalori":
        [140,20,360,240]}
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [78]:
dataFrame3

   isim    spor  kalori
8     j    koşu     140
9     k   yüzme      20
10    l    koşu     360
11    p  basket     240

In [79]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

   isim    spor  kalori
0     a    koşu     100
1     b   yüzme     200
2     c    koşu     300
3     d  basket     400
4     e    koşu     600
5     f   yüzme     700
6     g    koşu     800
7     h  basket     900
8     j    koşu     140
9     k   yüzme      20
10    l    koşu     360
11    p  basket     240

## merge

In [82]:
mergesozluk1={"isim":["a","b","c","d"],"spor":["koşu","yüzme","koşu","basket"]}
mgdataFrame1=pd.DataFrame(mergesozluk1,index=[0,1,2,3])

In [84]:
mgdataFrame1

  isim    spor
0    a    koşu
1    b   yüzme
2    c    koşu
3    d  basket

In [85]:
mgsozluk2={"isim":["a","b","c","d"],"kalori":
        [100,200,300,400]}
mgdataFrame2=pd.DataFrame(mgsozluk2)

In [86]:
mgdataFrame2

  isim  kalori
0    a     100
1    b     200
2    c     300
3    d     400

In [90]:
pd.merge(mgdataFrame1,mgdataFrame2,on="isim")

  isim    spor  kalori
0    a    koşu     100
1    b   yüzme     200
2    c    koşu     300
3    d  basket     400

In [91]:
maasSozlugu={"isim" : ["a","b","c","d"], "departman":["yazılım","satış",
            "pazarlama","yazılım"],"maas":[100,200,300,400]}

In [92]:
maasDataFr=pd.DataFrame(maasSozlugu)

In [93]:
maasDataFr

  isim  departman  maas
0    a    yazılım   100
1    b      satış   200
2    c  pazarlama   300
3    d    yazılım   400

In [106]:
maasDataFr["departman"]

0      yazılım
1        satış
2    pazarlama
3      yazılım
Name: departman, dtype: object

In [107]:
maasDataFr["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [108]:
maasDataFr["departman"].nunique()

3

In [109]:
maasDataFr["departman"].value_counts()

yazılım      2
satış        1
pazarlama    1
Name: departman, dtype: int64

In [110]:
def brutNete(maas):
    return maas*0.66

In [111]:
maasDataFr["maas"].apply(brutNete)

0     66.0
1    132.0
2    198.0
3    264.0
Name: maas, dtype: float64

In [112]:
maasDataFr.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [113]:
yeniBirSozluk ={"karakter sınıf":["sp","sp","bf","bf"],"karakter isimler":["asp","bsp","cbf","dbf"],
               "karakter yas":[9,19,29,39]}

In [114]:
karakterdf=pd.DataFrame(yeniBirSozluk)

In [115]:
karakterdf

  karakter sınıf karakter isimler  karakter yas
0             sp              asp             9
1             sp              bsp            19
2             bf              cbf            29
3             bf              dbf            39

In [116]:
karakterdf.pivot_table(values ="karakter yas",index=["karakter sınıf","karakter isimler"])

                                 karakter yas
karakter sınıf karakter isimler
bf             cbf                         29
               dbf                         39
sp             asp                          9
               bsp                         19